MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/FlyRf_Disp_26_07_22_11/GL050001C0_40_Display.cpp
#include "GL050001C0_40_Display.h"

#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_rgb.h"
#include "esp_idf_version.h"
#include "esp_heap_caps.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "SmoothStartupFonts.h"
#include "SmoothRuntimeFonts.h"
#include "WebRF.h"
#include <math.h>
#include <string.h>

static const int LCD_WIDTH = 800;
static const int LCD_HEIGHT = 480;

#ifndef GL050001C0_40_PINMAP_CONFIRMED
#define GL050001C0_40_PINMAP_CONFIRMED 1
#endif

#if GL050001C0_40_PINMAP_CONFIRMED
static const int LCD_PIN_DE = 45;
static const int LCD_PIN_VSYNC = 19;
static const int LCD_PIN_HSYNC = 47;
static const int LCD_PIN_PCLK = 48;
static const int LCD_PIN_DISP_EN = -1;

static const int LCD_PIN_DATA[16] = {
  1, 2, 3, 4, 5,        // B0..B4
  6, 7, 10, 11, 12, 13, // G0..G5
  14, 15, 16, 17, 18    // R0..R4
};
#endif

static esp_lcd_panel_handle_t panel = NULL;
static uint16_t *frameBuffer = NULL;
static SemaphoreHandle_t vsyncSemaphore = NULL;
static bool ready = false;
static uint32_t startupShownMs = 0;
static bool operationalFrameShown = false;
static bool shellDrawn = false;
static bool stateAvailable = false;
static GL050001C0_40_State displayState = {};
static GL050001C0_40_State renderedState = {};
static bool renderedStateValid = false;
static uint32_t lastDisplayUpdateMs = 0;
static String startupVersion;

// Поле полёта может занимать весь экран при повороте. Ограничиваем его
// обновление одним кадром в секунду, уменьшая нагрузку RGB DMA и PSRAM.
static const uint32_t DISPLAY_UPDATE_INTERVAL_MS = 1000UL;

static uint16_t rgb565(uint8_t r, uint8_t g, uint8_t b)
{
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

static const uint16_t COLOR_TEXT = rgb565(235, 245, 248);
static const uint16_t COLOR_STATUS_TEXT = rgb565(150, 165, 170);
static const uint16_t COLOR_WARN = rgb565(255, 190, 40);
static const uint16_t COLOR_SCREEN_BG = rgb565(0, 8, 14);
static const uint16_t COLOR_GRID = rgb565(145, 180, 188);
static const uint16_t COLOR_GREEN = rgb565(80, 235, 80);
static const uint16_t COLOR_RED = rgb565(255, 55, 45);
static const uint16_t COLOR_ORANGE = rgb565(255, 135, 25);
static const uint16_t COLOR_OWN_AIRCRAFT = rgb565(255, 255, 255);

static void fillRect(int x, int y, int w, int h, uint16_t color)
{
  if (frameBuffer == NULL || w <= 0 || h <= 0) {
    return;
  }
  if (x < 0) {
    w += x;
    x = 0;
  }
  if (y < 0) {
    h += y;
    y = 0;
  }
  if (x + w > LCD_WIDTH) {
    w = LCD_WIDTH - x;
  }
  if (y + h > LCD_HEIGHT) {
    h = LCD_HEIGHT - y;
  }
  if (w <= 0 || h <= 0) {
    return;
  }

  for (int row = 0; row < h; ++row) {
    uint16_t *dst = frameBuffer + ((y + row) * LCD_WIDTH) + x;
    for (int col = 0; col < w; ++col) {
      dst[col] = color;
    }
  }
}

static void drawStartupBackground()
{
  if (frameBuffer == NULL) {
    return;
  }

  for (int y = 0; y < LCD_HEIGHT; ++y) {
    for (int x = 0; x < LCD_WIDTH; ++x) {
      const int leftLight = ((LCD_WIDTH - 1 - x) * 22) / (LCD_WIDTH - 1);
      const int centerGlow = (y < 250) ? ((250 - y) * 8) / 250 : 0;
      const uint8_t r = 2 + leftLight / 7;
      const uint8_t g = 18 + leftLight / 2 + centerGlow;
      const uint8_t b = 42 + leftLight + centerGlow * 2;
      frameBuffer[y * LCD_WIDTH + x] = rgb565(r, g, b);
    }
  }
}

static uint16_t blendRgb565(uint16_t background, uint16_t foreground, uint8_t alpha)
{
  if (alpha == 255) {
    return foreground;
  }
  if (alpha == 0) {
    return background;
  }

  const uint32_t inverse = 255 - alpha;
  const uint32_t red = (((background >> 11) & 0x1F) * inverse +
                        ((foreground >> 11) & 0x1F) * alpha + 127) / 255;
  const uint32_t green = (((background >> 5) & 0x3F) * inverse +
                          ((foreground >> 5) & 0x3F) * alpha + 127) / 255;
  const uint32_t blue = ((background & 0x1F) * inverse +
                         (foreground & 0x1F) * alpha + 127) / 255;
  return (red << 11) | (green << 5) | blue;
}

static void drawSmoothTextMask(const SmoothTextMask &mask)
{
  uint32_t pixelIndex = 0;
  uint32_t rleIndex = 0;
  const uint32_t pixelCount = (uint32_t)mask.width * mask.height;

  while (rleIndex + 1 < mask.rleSize && pixelIndex < pixelCount) {
    const uint8_t count = mask.rle[rleIndex++];
    const uint8_t alpha = mask.rle[rleIndex++];
    if (alpha == 0) {
      pixelIndex += count;
      continue;
    }

    for (uint8_t index = 0; index < count && pixelIndex < pixelCount; ++index, ++pixelIndex) {
      const int x = mask.x + pixelIndex % mask.width;
      const int y = mask.y + pixelIndex / mask.width;
      if (x >= 0 && x < LCD_WIDTH && y >= 0 && y < LCD_HEIGHT) {
        uint16_t &destination = frameBuffer[y * LCD_WIDTH + x];
        destination = blendRgb565(destination, mask.color, alpha);
      }
    }
  }
}

static void drawSmoothStartupText()
{
  // Последняя маска содержит номер старого тестового проекта. Номер текущей
  // сборки выводится динамически, поэтому старую маску не рисуем.
  const uint8_t fixedMaskCount = SMOOTH_STARTUP_TEXT_COUNT > 0 ?
                                 SMOOTH_STARTUP_TEXT_COUNT - 1 : 0;
  for (uint8_t index = 0; index < fixedMaskCount; ++index) {
    drawSmoothTextMask(SMOOTH_STARTUP_TEXTS[index]);
  }
}

static void setPixel(int x, int y, uint16_t color)
{
  if (frameBuffer != NULL && x >= 0 && x < LCD_WIDTH && y >= 0 && y < LCD_HEIGHT) {
    frameBuffer[y * LCD_WIDTH + x] = color;
  }
}

static void drawLine(int x0, int y0, int x1, int y1, uint16_t color)
{
  const int dx = abs(x1 - x0);
  const int sx = x0 < x1 ? 1 : -1;
  const int dy = -abs(y1 - y0);
  const int sy = y0 < y1 ? 1 : -1;
  int error = dx + dy;
  for (;;) {
    setPixel(x0, y0, color);
    if (x0 == x1 && y0 == y1) {
      break;
    }
    const int twiceError = error * 2;
    if (twiceError >= dy) {
      error += dy;
      x0 += sx;
    }
    if (twiceError <= dx) {
      error += dx;
      y0 += sy;
    }
  }
}

static void drawLine3px(int x0, int y0, int x1, int y1, uint16_t color)
{
  // Заполненные сечения исключают промежутки между параллельными линиями
  // на диагоналях и обеспечивают одинаковое смешение RGB-субпикселей.
  int dx = abs(x1 - x0);
  int sx = x0 < x1 ? 1 : -1;
  int dy = -abs(y1 - y0);
  int sy = y0 < y1 ? 1 : -1;
  int error = dx + dy;
  for (;;) {
    fillRect(x0 - 1, y0 - 1, 3, 3, color);
    if (x0 == x1 && y0 == y1) break;
    const int doubledError = 2 * error;
    if (doubledError >= dy) { error += dy; x0 += sx; }
    if (doubledError <= dx) { error += dx; y0 += sy; }
  }
}

