MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/FlyRf_Disp_26_07_22_11/GL050001C0_40_Display.cpp
static void drawTrendArrow(int centerX, int topY, int bottomY, bool upward,
                           uint16_t color)
{
  const int headHeight = 7;
  const int headHalfWidth = 6;
  if (upward) {
    for (int row = 0; row < headHeight; ++row) {
      const int halfWidth = (row * headHalfWidth) / (headHeight - 1);
      fillRect(centerX - halfWidth, topY + row, halfWidth * 2 + 1, 1, color);
    }
    fillRect(centerX - 1, topY + headHeight, 3,
             max(1, bottomY - topY - headHeight + 1), color);
  } else {
    fillRect(centerX - 1, topY, 3,
             max(1, bottomY - topY - headHeight + 1), color);
    const int headTop = bottomY - headHeight + 1;
    for (int row = 0; row < headHeight; ++row) {
      const int halfWidth = ((headHeight - 1 - row) * headHalfWidth) /
                            (headHeight - 1);
      fillRect(centerX - halfWidth, headTop + row,
               halfWidth * 2 + 1, 1, color);
    }
  }
}

static void drawCircle(int centerX, int centerY, int radius, uint16_t color)
{
  int x = radius;
  int y = 0;
  int error = 1 - radius;
  while (x >= y) {
    setPixel(centerX + x, centerY + y, color);
    setPixel(centerX + y, centerY + x, color);
    setPixel(centerX - y, centerY + x, color);
    setPixel(centerX - x, centerY + y, color);
    setPixel(centerX - x, centerY - y, color);
    setPixel(centerX - y, centerY - x, color);
    setPixel(centerX + y, centerY - x, color);
    setPixel(centerX + x, centerY - y, color);
    ++y;
    if (error < 0) {
      error += 2 * y + 1;
    } else {
      --x;
      error += 2 * (y - x) + 1;
    }
  }
}

static void fillCircle(int centerX, int centerY, int radius, uint16_t color)
{
  for (int y = -radius; y <= radius; ++y) {
    const int halfWidth = (int)sqrtf((float)(radius * radius - y * y));
    fillRect(centerX - halfWidth, centerY + y, halfWidth * 2 + 1, 1, color);
  }
}

static void drawRectOutline(int x, int y, int width, int height, uint16_t color)
{
  drawLine(x, y, x + width - 1, y, color);
  drawLine(x, y + height - 1, x + width - 1, y + height - 1, color);
  drawLine(x, y, x, y + height - 1, color);
  drawLine(x + width - 1, y, x + width - 1, y + height - 1, color);
}

static const SmoothGlyph *findSmoothGlyph(const SmoothFont &font, uint16_t codepoint)
{
  for (uint16_t index = 0; index < font.glyphCount; ++index) {
    if (font.glyphs[index].codepoint == codepoint) {
      return &font.glyphs[index];
    }
  }
  return NULL;
}

static uint16_t readUtf8Codepoint(const char *text, size_t length, size_t &index)
{
  const uint8_t first = (uint8_t)text[index++];
  if (first < 0x80 || index >= length) {
    return first;
  }
  if ((first & 0xE0) == 0xC0 && index < length) {
    return ((uint16_t)(first & 0x1F) << 6) | ((uint8_t)text[index++] & 0x3F);
  }
  if ((first & 0xF0) == 0xE0 && index + 1 < length) {
    const uint16_t codepoint = ((uint16_t)(first & 0x0F) << 12) |
                               ((uint16_t)((uint8_t)text[index] & 0x3F) << 6) |
                               ((uint8_t)text[index + 1] & 0x3F);
    index += 2;
    return codepoint;
  }
  return '?';
}

static void drawRuntimeGlyph(int originX, int baselineY, const SmoothGlyph &glyph, uint16_t color)
{
  uint32_t pixelIndex = 0;
  uint16_t rleIndex = 0;
  const uint32_t pixelCount = (uint32_t)glyph.width * glyph.height;
  while (rleIndex + 1 < glyph.rleSize && pixelIndex < pixelCount) {
    const uint8_t count = glyph.rle[rleIndex++];
    const uint8_t alpha = glyph.rle[rleIndex++];
    if (alpha == 0) {
      pixelIndex += count;
      continue;
    }
    for (uint8_t index = 0; index < count && pixelIndex < pixelCount; ++index, ++pixelIndex) {
      const int x = originX + glyph.xOffset + pixelIndex % glyph.width;
      const int y = baselineY + glyph.yOffset + pixelIndex / glyph.width;
      if (x >= 0 && x < LCD_WIDTH && y >= 0 && y < LCD_HEIGHT) {
        uint16_t &destination = frameBuffer[y * LCD_WIDTH + x];
        destination = blendRgb565(destination, color, alpha);
      }
    }
  }
}

static int smoothTextWidth(const char *text, const SmoothFont &font)
{
  if (text == NULL) {
    return 0;
  }
  int width = 0;
  const size_t length = strlen(text);
  size_t index = 0;
  while (index < length) {
    const SmoothGlyph *glyph = findSmoothGlyph(font, readUtf8Codepoint(text, length, index));
    width += glyph != NULL ? glyph->xAdvance : font.lineHeight / 2;
  }
  return width;
}

static void drawSmoothString(int x, int baselineY, const char *text,
                             uint16_t color, const SmoothFont &font)
{
  if (text == NULL) {
    return;
  }
  const size_t length = strlen(text);
  size_t index = 0;
  int cursorX = x;
  while (index < length) {
    const SmoothGlyph *glyph = findSmoothGlyph(font, readUtf8Codepoint(text, length, index));
    if (glyph != NULL) {
      drawRuntimeGlyph(cursorX, baselineY, *glyph, color);
      cursorX += glyph->xAdvance;
    } else {
      cursorX += font.lineHeight / 2;
    }
  }
}

static void drawSmoothStringCentered(int centerX, int baselineY, const char *text,
                                     uint16_t color, const SmoothFont &font)
{
  drawSmoothString(centerX - smoothTextWidth(text, font) / 2,
                   baselineY, text, color, font);
}

static uint16_t targetColor(uint8_t alarmLevel)
{
  if (alarmLevel >= 3) {
    return COLOR_RED;
  }
  if (alarmLevel == 2) {
    return COLOR_ORANGE;
  }
  if (alarmLevel == 1) {
    return COLOR_WARN;
  }
  return COLOR_TEXT;
}

static void drawBatteryIcon(int x, int y, uint8_t percent, bool valid)
{
  const uint16_t border = valid ? COLOR_TEXT : COLOR_GRID;
  const uint16_t levelColor = !valid ? COLOR_GRID :
                              (percent > 50 ? COLOR_GREEN :
                               (percent > 20 ? COLOR_WARN : COLOR_RED));
  drawRectOutline(x, y, 45, 20, border);
  fillRect(x + 45, y + 6, 4, 8, border);
  // Пять сегментов соответствуют шагу 20%. При 0% все сегменты пусты,
  // при 100% заполнены все пять. Процент рассчитан по диапазону 7...12 В.
  const int segments = valid && percent > 0 ? ((percent + 19) / 20) : 0;
  for (int segment = 0; segment < 5; ++segment) {
    fillRect(x + 4 + segment * 8, y + 4, 6, 12,
             segment < segments ? levelColor : COLOR_SCREEN_BG);
  }
}

