MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/FlyRf_Disp_26_07_22_11/GL050001C0_40_Display.cpp
static void drawStatusBlocks()
{
  char buffer[48];
  if (displayState.showLoraStatus) {
    if (displayState.baseConnected)
      snprintf(buffer, sizeof(buffer), "LoRa Tx %lu", (unsigned long)displayState.loraTxPackets);
    else
      snprintf(buffer, sizeof(buffer), "LoRa Tx ---");
    drawSmoothString(8, 412, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.baseConnected)
      snprintf(buffer, sizeof(buffer), "LoRa Rx %lu", (unsigned long)displayState.loraRxPackets);
    else
      snprintf(buffer, sizeof(buffer), "LoRa Rx ---");
    drawSmoothString(8, 433, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.baseConnected && displayState.loraRfHz != 0) {
      snprintf(buffer, sizeof(buffer), "LoRa RF %.3f", displayState.loraRfHz / 1000000.0f);
    } else {
      snprintf(buffer, sizeof(buffer), "LoRa RF ---");
    }
    drawSmoothString(8, 454, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.baseConnected && displayState.loraRssiDb < 0) {
      snprintf(buffer, sizeof(buffer), "LoRa RSSI %d dB", (int)displayState.loraRssiDb);
    } else {
      snprintf(buffer, sizeof(buffer), "LoRa RSSI ---");
    }
    drawSmoothString(8, 475, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  }

  if (displayState.showLanStatus) {
    if (displayState.baseConnected)
      snprintf(buffer, sizeof(buffer), "LAN %s  UDP %s",
               displayState.lanLinkUp ? "On" : "Off",
               displayState.lanUdpWorking ? "On" : "Off");
    else
      snprintf(buffer, sizeof(buffer), "LAN ---  UDP ---");
    drawSmoothString(600, 412, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.baseConnected)
      snprintf(buffer, sizeof(buffer), "IP %u.%u.%u.%u",
               (unsigned)displayState.lanIp[0], (unsigned)displayState.lanIp[1],
               (unsigned)displayState.lanIp[2], (unsigned)displayState.lanIp[3]);
    else
      snprintf(buffer, sizeof(buffer), "IP ---");
    drawSmoothString(600, 433, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.baseConnected)
      snprintf(buffer, sizeof(buffer), "UDP %u", (unsigned)displayState.lanUdpPort);
    else
      snprintf(buffer, sizeof(buffer), "UDP ---");
    drawSmoothString(600, 454, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.baseConnected)
      snprintf(buffer, sizeof(buffer), "LAN %lu/%lu",
               (unsigned long)displayState.lanTxPackets,
               (unsigned long)displayState.lanRxPackets);
    else
      snprintf(buffer, sizeof(buffer), "LAN ---/---");
    drawSmoothString(600, 475, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  } else if (displayState.showGpsStatus) {
    if (displayState.baseConnected)
      snprintf(buffer, sizeof(buffer), "GPS Sat %u", (unsigned)displayState.satellites);
    else
      snprintf(buffer, sizeof(buffer), "GPS Sat ---");
    drawSmoothString(615, 433, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.baseConnected && displayState.gnssValid &&
        displayState.latitude != 0.0f) {
      snprintf(buffer, sizeof(buffer), "GPS Lat %.5f", displayState.latitude);
      drawSmoothString(615, 454, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    } else {
      drawSmoothString(615, 454, "GPS Lat ---", COLOR_STATUS_TEXT, FONT_TINY);
    }
    if (displayState.baseConnected && displayState.gnssValid &&
        displayState.longitude != 0.0f) {
      snprintf(buffer, sizeof(buffer), "GPS Lon %.5f", displayState.longitude);
      drawSmoothString(615, 475, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    } else {
      drawSmoothString(615, 475, "GPS Lon ---", COLOR_STATUS_TEXT, FONT_TINY);
    }
  }
}

static void drawTopBar()
{
  char buffer[48];
  if (displayState.baseConnected && displayState.timeValid) {
    snprintf(buffer, sizeof(buffer), "%02u:%02u",
             (unsigned)displayState.hour, (unsigned)displayState.minute);
  } else {
    snprintf(buffer, sizeof(buffer), "--:--");
  }
  drawSmoothString(8, 32, buffer, COLOR_GREEN, FONT_LARGE);

  if (displayState.showPowerVoltage || displayState.showPowerCurrent) {
    if (displayState.powerValid) {
      if (displayState.showPowerVoltage && displayState.showPowerCurrent) {
        snprintf(buffer, sizeof(buffer), "%.1f V  %.0f mA",
                 displayState.voltageV, displayState.currentMa);
      } else if (displayState.showPowerVoltage) {
        snprintf(buffer, sizeof(buffer), "%.1f V", displayState.voltageV);
      } else {
        snprintf(buffer, sizeof(buffer), "%.0f mA", displayState.currentMa);
      }
    } else {
      snprintf(buffer, sizeof(buffer), "POWER ---");
    }
    drawSmoothString(540, 27, buffer, COLOR_TEXT, FONT_SMALL);
  }
  if (displayState.showPowerBattery) {
    drawBatteryIcon(690, 8, displayState.batteryPercent, displayState.powerValid);
    if (displayState.powerValid) {
      snprintf(buffer, sizeof(buffer), "%u%%", (unsigned)displayState.batteryPercent);
    } else {
      snprintf(buffer, sizeof(buffer), "---");
    }
    drawSmoothString(747, 27, buffer, COLOR_TEXT, FONT_SMALL);
  }
}

static void drawOperationalOverlays();

static void drawOperationalFrame()
{
  fillRect(0, 0, LCD_WIDTH, LCD_HEIGHT, COLOR_SCREEN_BG);
  drawRadar();
  drawStatusBlocks();
  drawTopBar();
  drawTargetTable();
  drawOperationalOverlays();
}

static void drawOperationalOverlays()
{

  if (displayState.trackerMessageVisible && displayState.trackerMessage[0] != '\0') {
    fillRect(20, 62, 760, 116, COLOR_SCREEN_BG);
    drawRectOutline(20, 62, 760, 116, COLOR_WARN);
    const SmoothFont &messageFont =
      smoothTextWidth(displayState.trackerMessage, FONT_SMALL) <= 730 ?
      FONT_SMALL : FONT_TINY;
    drawSmoothStringCentered(400, 126, displayState.trackerMessage,
                             COLOR_WARN, messageFont);
  }

  if (displayState.gnssStatusVisible && displayState.baseConnected &&
      !displayState.trackerMessageVisible) {
    fillRect(165, 190, 470, 95, COLOR_SCREEN_BG);
    drawRectOutline(165, 190, 470, 95, COLOR_WARN);
    drawSmoothStringCentered(400, 228, "ОПРЕДЕЛЕНИЕ МЕСТОПОЛОЖЕНИЯ",
                             COLOR_WARN, FONT_SMALL);
    drawSmoothStringCentered(400, 260, "ОЖИДАЙТЕ", COLOR_WARN, FONT_SMALL);
  }

  if (!displayState.baseConnected) {
    drawSmoothStringCentered(400, 245, "НЕТ СВЯЗИ С БАЗОЙ", COLOR_RED, FONT_LARGE);
  }

  if (displayState.sosActive) {
    fillRect(300, 275, 200, 78, COLOR_SCREEN_BG);
    drawRectOutline(300, 275, 200, 78, COLOR_WARN);
    drawSmoothStringCentered(400, 329, "SOS", COLOR_WARN, FONT_MEDIUM);
  }
}

